"Display settings" = "Megjelenítési beállítások";
"Show File Extensions" = "Fájl kiterjesztés mutatása";
"Maintenance (next launch only)" = "Szerviz üzemmód (csak a következő indítástól)";
"Remove Cached Files" = "Cache fájlok eltávolítása";
